package com.company;

/**
 * 数组的定义
 * 数组的使用
 * 二维数组
 *
 * 数组的定义
 *    数组：是一组相关变量的集合，一个数组就是一连串的变量，数组按照使用可以分为
 *    一维数组、二维数组和多维数组。
 *    数组的优点：定义100个数量
 *      1.不使用数组：int i1; int i2...int i100;
 *      2.使用数组:int i[100]
 *    一维数组的创建：
 *      1.声明数组:
 *          数组类型  数组名称[] = null;
 *      2.分配内存:
 *      数组名称 = new 数据类型[长度];
 *    声明数组第二种形式：
 *      数据类型[]  数组名称 = null;
 *    数组的访问：
 *      数组中的元素通过"数组名称[下标]" 来进行访问
 *      注意："下标"从0开始
 *    取得数组的长度：
 *      数组名称.length
 *
 *
 */
public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
